app/controllers/accounts/sessions_controller.rb

  def create
    account = Account.find_by_email(params[:email])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = $1  ORDER BY "accounts"."id" ASC LIMIT 1  [["email", "rio.dermawan57@gmail.com"]]